peakhunt/stm32f103c8t6_usb_hid/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define led_Pin GPIO_PIN_13
#define led_GPIO_Port GPIOC
#define joystick_left_Pin GPIO_PIN_15
#define joystick_left_GPIO_Port GPIOA
#define joystick_right_Pin GPIO_PIN_3
#define joystick_right_GPIO_Port GPIOB
#define joystick_up_Pin GPIO_PIN_4
#define joystick_up_GPIO_Port GPIOB
#define joystick_down_Pin GPIO_PIN_5
#define joystick_down_GPIO_Port GPIOB
#define joystick_button0_Pin GPIO_PIN_6
#define joystick_button0_GPIO_Port GPIOB
#define joystick_button1_Pin GPIO_PIN_7
#define joystick_button1_GPIO_Port GPIOB
#define joystick_button2_Pin GPIO_PIN_8
#define joystick_button2_GPIO_Port GPIOB
#define joystick_button3_Pin GPIO_PIN_9
#define joystick_button3_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
